cask_args appdir: '/Applications'

# brew
brew "git"
brew "coreutils"
brew "neovim"
brew "tmux"
brew "fzf"
brew "jq"
brew "yq"
brew "mise"
brew "mycli"
brew "mysql-client"
brew "sheldon"
brew "pure"
brew "pnpm"
brew "postgresql@17"
brew "tree"
brew "ghq"
brew "uv"
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"
# kube関連
brew "krew"
brew "kubectx"
brew "kubernetes-cli"
brew "helm"
brew "stern"
brew "kube-ps1"
brew "kind"
brew "dive" # Docker image explorer

# cask
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'iterm2'
cask "cursor"
cask "raycast"
cask "visual-studio-code"